app/controllers/categories_controller.rb

UPDATE `categories` SET `name` = 'Fruits et légume', `updated_at` = '2015-11-01 19:33:29' WHERE `categories`.`id` = 2
---
  def update
    respond_to do |format|
      if @category.update(category_params)